Repository: 84000/data-translation-memory
Catalog: toh437-v1.tmx
Source language: bo
Languages: en

source: ཕྱི་ནས་ཐམས་ཅད་བཏང་སྙོམས་ལ། །སེམས་ཙམ་ལ་ནི་མཉམ་པར་གཞག །
en: Afterwards, one should regard everything with equanimity In its condition of being “mind only.”

source: ཐ་མལ་རྣམ་པར་སྤང་བའི་ཕྱིར། །སེམས་ཀྱང་སླར་ཡང་སྟོང་པར་བྱ། །
en: Then, in order to discard the ordinary, The mind must once more be emptied.

source: ཡང་སྲིད་ལེན་པའི་ཕུང་པོ་ལྔ། །སྟོང་པ་ཉིད་ཀྱི་མེ་ཡིས་བསྲེག །
en: The five aggregates of the process of re-existence Shall be consumed by the fire of emptiness.

source: ཨོཾ་ཤཱུནྱ་ཏཱ་ཛྙཱ་ན་བཛྲ་སྭ་བྷཱ་བ་ཨཧྨ་ཀོ྅་ཧཾ།
en: Oṃ śūnyatā­jñāna­vajra­svabhāvātmako ˈham

source: ཡུད་ཙམ་སྟོང་པའི་རྣལ་འབྱོར་ཉིད། །བྱས་ནས་སེམས་ནི་ངལ་སོས་བྱ། །
en: For a while one should practice this emptiness yoga And so bring the mind refreshing rest.

source: སྔོན་གྱི་དམ་བཅས་དྲན་བྱས་ནས། །ས་བོན་ཙམ་ཞིག་ཡང་དྲན་བྱ། །
en: Recollecting the vows taken earlier, One should once more focus on simply the seed-syllable.

source: གཅིག་པུ་མྱ་ངན་འདས་པ་ཡིས། །སེམས་ཅན་བསླུས་པར་འགྱུར་བའི་ཕྱིར། །སྲིད་པའི་རྒྱ་མཚོ་མཐའ་མེད་ལས། །བདག་གིས་དེ་དག་ཅི་ལྟར་བསྒྲལ། །
en: “An exclusive nirvāṇa Would mean deceiving sentient beings. How shall I liberate them From the endless ocean of existence?”

source: འདི་ལྟར་བསམས་ནས་བརྩེ་ལྡན་དེས། །སེམས་མེད་པ་ཡི་སྟོང་པ་ཡང་། །
en: Contemplating thus, the one who possesses love Will abandon the emptiness devoid of mind.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་སེམས། །སེམས་ཉིད་ཀྱིས་ནི་བསྐྱེད་པར་བྱ། །
en: A mind that is of the nature of the field of phenomena Must be brought forth through mind itself.

source: སངས་རྒྱས་བྱིན་རླབས་ལས་ས་བོན། །དེ་ལ་ཨུཏྤལ་ཞེས་བྱར་འགྱུར། །
en: By the Buddha’s blessing arises the seed-syllable, And from that, that which is called an utpala

source: ཨུཏྤལ་དཀྱིལ་དུ་ཟླ་བའི་གཟུགས། །ཡི་གེ་ཨ་ལས་བྱུང་བའོ། །
en: On the utpala, there is a moon disk Arisen from the syllable a

source: སླར་ཡང་ཟླ་བ་དེར་ས་བོན། །དེ་ལས་འོད་ཟེར་འཕྲོས་གྱུར་པ། །
en: On that moon, again, is the seed-syllable, From which emanate rays of light.

source: དེ་ཡིས་མ་ལུས་འཇིག་རྟེན་ཁམས། །རྣམ་པར་སྦྱངས་པར་བསྒོམ་པར་བྱ། །
en: Thereby all realms of the world Are seen to be thoroughly purified.

source: དེ་ཡིས་སྦྱངས་ཤིང་གསལ་བྱས་ནས། །འོད་ཟེར་ཀུན་གྱིས་སངས་རྒྱས་ཚོགས། །ཨུཏྤལ་ལ་ཞུགས་བསྒོམ་པར་བྱ། །
en: Once they are purified and illumined, One should perceive that great numbers of buddhas Melt into light and enter the seed-syllable.

source: དེ་ལས་སྒྲོལ་མ་འབྱུང་བར་འགྱུར། །
en: From that arises Tārā.

source: བསྟན་འདྲའི་ལྷ་མོ་བཙོད་མདོག་ཅན། །རྒྱན་རྣམས་ཀུན་གྱིས་རྣམ་བརྒྱན་པས། །
en: As explained, the goddess is of the color of madder rose And adorned with all of the ornaments.

source: དམ་ཚིག་གཟུགས་ནི་མཉམ་བསྐྱེད་ནས། །ཡེ་ཤེས་འཁོར་ལོ་ཡང་དག་བཀུག །
en: First one should develop the samaya form And then summon the wisdom circle.

source: ཡུད་ཙམ་གྱིས་ནི་ངེས་རྫོགས་པའོ། །
en: This occurs in an instant.

source: ཡེ་ཤེས་འཁོར་ལོ་མདུན་གནས་པ། །
en: The wisdom circle remains in front.

source: དམ་ཚིག་ཕྱག་རྒྱའི་སྦྱོར་བ་ཡིས། །ཁ་ཡི་ལམ་ནས་གཞུག་པར་བྱ།
en: With the application of the samaya seal They should enter by the open pathway.

source: ལག་པ་ཐལ་མོ་སྦྱར་བྱས་ནས། །མཐེའུ་ཆུང་གཉིས་ནི་བསྒོམ་པར་བྱ། །
en: The palms of the hands are joined And the two little fingers visualized.

source: གུང་མོ་གཉིས་ནི་རྩེ་མོར་སྦྱར། །རྩེ་མོའི་ནང་དུ་མིང་མེད་གཞུག །
en: The middle fingers are joined at the tips And the ring fingers are between them.

source: མཛུབ་མོ་གཉིས་ནི་དབུ་མར་སྦྱར། །མཐེ་བོང་གཉིས་ནི་འོག་ཏུ་བཀུག །
en: The index fingers are joined to the middle ones And the thumbs are bent below.

source: དམ་ཚིག་ཕྱག་རྒྱ་འདི་བཅིངས་ནས། །འཁོར་ལོ་བཀུག་ནས་གཞུག་པར་བྱ། །
en: Having formed the samaya seal in this way One must summon the circle and cause it to enter.

source: བྱང་ཆུབ་རྡོ་རྗེ་སངས་རྒྱས་ལ། །ཇི་ལྟར་མཆོད་ཆེན་གསོལ་མཛད་པ། །
en: “Just as Bodhivajra offers The great worship to the buddhas,

source: སངས་རྒྱས་རྣམས་ལ་ཚིགས་བཅད་འདིས། །དབང་བསྐུར་བར་ནི་གསོལ་བ་གདབ། །
en: With the following verses to the buddhas One should request empowerment:

source: བདག་ཀྱང་བསྐྱབ་པའི་དོན་གྱི་ཕྱིར། །ནམ་མཁའི་རྡོ་རྗེ་དེང་བདག་སྩོལ། །
en: So too, in order to protect me, Please, now grant it to me, O Khavajra.”

source: རྒྱལ་བའི་དབང་བསྐུར་ཞེས་བྱ་བས། །སྤྱན་ལ་སོགས་པ་ལྔ་པའོ། །
en: With the so-called “empowerment of the Victor” Locanā and the other four arise.

source: རྡོ་རྗེ་ཆེན་པོས་དབང་བསྐུར་བ། །ཁམས་གསུམ་པོ་ཡིས་ཕྱག་བྱས་པ། །
en: “The empowerment by the great vajra, Which is venerated throughout the three realms,

source: རྒྱལ་པོའི་མེ་ཏོག་དབང་བསྐུར་ཞིང་། །ཆེན་པོར་གྱུར་པ་དེ་སྩོལ་མཛོད། །
en: “The consecration of a king with flowers, Great ones, bestow that upon me.”

source: གསང་བ་གསུམ་གྱི་གནས་ལས་བྱུང་། །
en: And which originates from the abodes of three secrets,

source: སངས་རྒྱས་ཀུན་གྱིས་སྦྱིན་པར་བྱ། །
en: That shall be given by all the buddhas.”

source: སངས་རྒྱས་སྒྲོལ་མ་དབང་བསྐུར་བས། །ཆོས་ནི་གཙུག་གི་ནོར་བུར་འགྱུར། །
en: As the buddhas empower Tārā She becomes crowned with the Dharma.

source: འོད་ཟེར་དམར་པོ་སྣ་ཚོགས་ཀྱིས། །འགྲོ་བ་གསུམ་པོ་སྣང་བར་བྱེད།
en: With red light of different hues She illuminates the three worlds.

source: དབང་བསྐུར་རིན་ཆེན་ཐོབ་འགྱུར་ན། །དངོས་གྲུབ་ཐམས་ཅད་རབ་སྒྲུབ་བྱེད། །
en: One who has obtained the jewel of empowerment Will attain all accomplishments.

source: ཇི་ལྟར་སླར་བསྟན་ཆོ་ག་ཡིས། །ལོ་ཕྱེད་བརྟན་པར་བརྩམས་ནས་ནི། །
en: By means of the described ritual One must practice stably for half a year

source: གཏོར་མ་དུས་གསུམ་གཏང་བར་བྱ། །
en: And offer bali at the three times.

source: རལ་གྲི་ས་འོག་དངོས་གྲུབ་དང་། །མི་སྣང་བ་དང་བཅུད་ལེན་དང་།
en: The sword, the accomplishment of the netherworld, Invisibility, the extraction of essences,

source: སྔགས་འདི་ཡིས་ནི་ཁར་བ་འམ། །ཁུར་བ་ལ་སོགས་ཆོ་ག་ཡིས། །རྨི་ལམ་མཚན་མ་ཐོབ་པར་འགྱུར། །
en: By means of this mantra, And through the ritual of cane or cakes, One will obtain a sign during dream.

source: མི་མཐོང་བ་དང་མཁའ་སྤྱོད་ཉིད། །དེ་བཞིན་རྐང་བྱུག་མིག་སྨན་དང་། །
en: Anonymity, celestial realms, Foot unguent, and eye ointment—

source: རྨི་ལམ་མཚན་མ་སྟོན་འགྱུར་ཞིང་། །དངོས་གྲུབ་རང་ཉིད་འབྱུང་བར་འགྱུར། །
en: The signs will be seen in dreams And the accomplishments themselves will manifest.

source: གལ་ཏེ་དེ་ལ་དགའ་འགྱུར་ན། །གྲུབ་པ་ཕྲ་མོ་སྒྲོལ་མས་གྲུབ། །
en: If one becomes fond of these, Minor accomplishments will be attained through Tārā.

source: འཁོར་ལོས་སྒྱུར་ནས་རྒྱལ་སྲིད་དང་། །དབང་པོའི་ལོངས་སྤྱོད་ཐམས་ཅད་བྱེད། །
en: Having become a universal monarch, one attains The kingdom and the pleasures of the senses.

source: ཟླ་དྲུག་ཐ་མའི་ཟླ་གཅིག་གོ། །མཚན་གཅིག་རངས་པར་བཟླས་བྱ
en: At the final moon among the six, Recite delightedly for one night And

source: སྒོམ་དང་བཟླས་པར་ལྡན་པ་ལ། །རྨི་ལམ་དུ་ཡང་རབ་གྲུབ་བ་བྱེད། །
en: For the one endowed with meditation and recitation These are even attained in dream.

source: ས་ཏེ། །ཨུཏྤལ་ཕྱག་རྒྱ་བཅིངས་ནས་ནི། །བཟླས་ནས་ཕྱག་རྒྱ་ཡུད་ཀྱིས་
en: form the utpala mudrā. As one recites, it suddenly bursts into flames.

source: ཕྱག་རྒྱ་འདི་ཡི་མཐུ་ཡིས་ནི། །བཙུན་མོ་དང་བཅས་ཚངས་པ་དང་། །དབང་པོ་ཉེ་དབང་དྲག་པོ་སོགས། །བཀུག་ནས་དབང་དུ་འགྱུར་བར་བྱེད། །
en: By the power of this mudrā Brahma, Indra, Upendra, Rudra, and so forth, Together with their spouses, Are summoned and arrive enthralled.

source: དེང་ནས་བརྩམས་ནས་དངོས་གྲུབ་ཀུན།
en: From then on, one will be accomplished in every respect

source: བདག་འཁོར་འཆིང་བ་ལས་གྲོལ་འགྱུར། །
en: And be free from the bonds of saṃsāra,

source: ཆུ་དང་འདམ་གྱི་སྐྱོན་དག་གིས། །པདྨ་གོས་པར་མི་འགྱུར་ལྟར། །
en: Just as a lotus will be unstained By water soiled with mud.

source: དངུལ་ཆུ་རེག་ནས་དུ་མར་འགྱུར། །
en: When touched, quicksilver becomes many,

source: བསྡུས་ནས་སླར་ཡང་གཅིག་ཏུ་འགྱུར། །
en: Yet when coalesced, it once more becomes one;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་འགྱུར་ན། །དངོས་གྲུབ་ཐོབ་པའི་སེམས་དེ་བཞིན། །
en: Within the state of omniscience The same is the case with the accomplished one’s mind.

source: གྲུབ་པའི་དངུལ་ཆུས་རེག་གྱུར་ནས། །ཟངས་མ་གསེར་དུ་འགྱུར་བ་བཞིན། །
en: When touched by perfected quicksilver, Copper turns to gold;

source: གྲུབ་པའི་གསང་སྔགས་ཀྱིས་རེག་ནས། །སྔགས་པ་སངས་རྒྱས་སྐུར་ཡང་འགྱུར། །
en: Likewise, when touched by the perfected mantra The practitioner of mantra will become the bodies of the Buddha.

source: ལྷ་ཡི་དབང་ཕྱུག་དུ་འགྱུར་ཞིང་། །ཁམས་གསུམ་ཀུན་གྱི་དབང་ཕྱུག་འགྱུར། །
en: They attain the station of the lord of the gods And become lords of the triple universe.

source: སངས་རྒྱས་རིགས་སུ་བྱུང་ནས་ནི། །འཁོར་ལོ་བསྐོར་བར་ཡང་འགྱུར་རོ། །
en: When born in the family of Buddha, They become turners of the wheel.

source: བལྟམས་དང་རབ་ཏུ་འབྱུང་མཛད་པ། །དཀའ་བ་སྤྱོད་པའི་སྤྱོད་མཛད་ཅིང་། །
en: They are born, go forth into homelessness, Practice the difficult conduct, And

source: བྱང་ཆུབ་སྤྱོད་པའང་སྤྱོད་མཛད་ན། །སངས་རྒྱས་ཉིད་ཀྱང་དྲན་པར་མཛད། །
en: as they also engage in the conduct of enlightenment, They recollect buddhahood itself.

source: ལྷ་ལས་བབས་དང་སྤྲུལ་པ་དང་། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། །མྱ་ངན་འདས་པ་ཆེན་པོ་དང་། །དུར་ཁྲོད་གཤེགས་པ་དེ་བཞིན་ནོ། །
en: Likewise, they descend from the gods, manifest emanations, Turn the wheel of Dharma, Attain the great nirvāṇa, And depart for a cemetery.

source: འཇིག་རྟེན་གསུམ་དུ་ལུས་སྤངས་ནས། །རྒྱལ་བ་ལོངས་སྤྱོད་རྫོགས་སྐུ་ཡིས། །
en: Having left their bodies in the triple world, The victorious ones, by means of the enjoyment body,

source: གནས་གཙང་མར་ནི་སླར་གཤེགས་ནས། །སྤྲུལ་པར་བྱུང་བའི་སྐུ་ཡང་འོང་།
en: Return again to the pure abodes, And so the emanation body emerges.

source: གླེགས་བམ་རས་རིས་རིམ་པ་ཡིས། །ཆོས་ཀྱི་སྐུ་ཡང་འཇུག་པར་མཛད། །
en: By means of the procedures of books and paintings, There is engagement with the dharma body as well.

source: གང་གིས་དེ་ཡི་གྲུབ་པའི་སྔགས། །སངས་རྒྱས་རྣམས་ཀྱིས་དེ་ཉིད་གསུངས། །
en: Hence, the mantra, thereby established, Has indeed been taught by the buddhas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དེ་ཉིད་ཀྱི་ཐུགས་ལ་རྣམ་པར་བརྟགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: All the blessed ones, the thus-gone ones, then addressed the great bodhisattva Vajrapāṇi, so as to examine his noble mind:

source: ལག་ན་རྡོ་རྗེ་ཇི་ལྟར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་རྡོ་རྗེའི་སྐུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྐུ་སའི་ཕྱོགས་གང་དུ་དུས་བྱེད་པར་འགྱུར་བ་ཡིན།
en: “How, O Vajrapāṇi, could the buddhas, the blessed ones, who possess vajra bodies, who possess dharmadhātu bodies, possibly die at some location on earth?”

source: དེ་ནས་ལག་ན་རྡོ་རྗེས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Vajrapāṇi, in turn, offered the following words to those buddhas and bodhisattvas:

source: གང་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་འདི་སྐད་དུ། ཅི་ལྟར་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྡོ་རྗེའི་སྐུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྐུ་མི་ཕྱེད་པའི་སྐུ་སའི་ཕྱོགས་འགའ་ཞིག་ཏུ་དུས་བྱེད་པར་འགྱུར་བ་ཡིན་ཞེས་སྨྲ།
en: “The bodhisattvas have asked me this, ‘How could buddhas, who possess vajra bodies, dharmadhātu bodies, bodies of non-duality, possibly die at some location on earth?’

source: དེས་འདི་སྐད་ཉོན་ཅིག །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གང་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དེ་ནི་བདེ་བ་ཅན་དུ་འགྲོ་བའོ། །
en: And he proceeded, “Listen, O bodhisattvas, the so-called nirvāṇa means a passage to the realm of bliss.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The bodhisattvas enquired,

source: ཅི་ལག་ན་རྡོ་རྗེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཆོས་སྐུ་སྤངས་ནས་བདེ་བ་ཅན་དུ་འགྲོ་བའམ།
en: O Vajrapāṇi, do the buddhas, the blessed ones, go to the realm of bliss after they relinquish the dharma body,

source: སྤྲུལ་པའི་སྐུ་སྤངས་ནས་ལོངས་སྤྱོད་རྫོགས་པའི་སྐུས་བདེ་བ་ཅན་དུ་འགྲོ་བར་འགྱུར།
en: or do they go to the realm of bliss by means of the enjoyment body, having left behind their emanation body?

source: ཆོས་ཀྱི་སྐུ་སྤངས་ནས་འགྲོ་བར་འགྱུར་ཞེས་བྱ་བ་དེ་ཇི་ལྟ་བུ་ཡིན། །
en: How could they depart, having left behind the dharma body?”

source: ལག་ན་རྡོ་རྗེས་སྨྲས་པ།
en: Vajrapāṇi replied,

source: ཅི་ལྟར་སྒྱུ་མ་མཁན་གྱི་སྐྱེས་བུ་གང་ཞིག་གིས་དགོས་པའི་དོན་བསྒྲུབ་པའི་ཕྱིར་སྒྱུ་མ་སྤྲུལ་ནས་དགོས་པ་སྒྲུབ་པར་བྱེད་དོ།
en: “A person with magical powers may employ magic for some specific purpose, and so also succeed in achieving that purpose.

source: དེ་བཞིན་དུ་གདོད་ནས་གྲུབ་པའི་སངས་རྒྱས་རྣམས། །སེམས་ཅན་ཡོངས་སུ་གཟུང་བའི་ཕྱིར། །འཁོར་ལོས་སྒྱུར་བ་འདས་གྱུར་ནས། །སྐྱེ་བ་ཡོངས་སུ་འཛིན་པར་མཛད། །
en: Likewise: “Accomplished since the beginning, The buddhas engage in the act of accepting birth, To provide for sentient beings, When a universal monarch has gone beyond.

source: གང་ཚེ་སངས་རྒྱས་འདས་པ་ན། །དེ་ཚེ་འཁོར་ལོས་སྒྱུར་བ་འབྱུང་། །
en: “When a buddha goes beyond, A universal monarch appears.

source: དེ་གཉིས་མེད་པར་འཇིག་རྟེན་འདིར། །ནམ་ཡང་འབྱུང་བ་མ་ཡིན་ནོ། །
en: In this world there is never a time When both of them are absent.

source: གདུལ་བྱའི་འཇིག་རྟེན་ལ་བརྟེན་ནས། །རྐང་གཉིས་མཆོག་གིས་བརྟུལ་ནས་ནི། །
en: “The Buddha, the best among those who walk on two feet, Provided guidance to beings in need of guidance.

source: ལོ་ནི་བརྒྱད་ཅུར་བཞུགས་མཛད་དེ། །སངས་རྒྱས་རྒྱལ་བའི་གནས་སུ་གཤེགས། །
en: After having remained for eighty years, He departed for the abode of the victorious ones.

source: སངས་རྒྱས་སྒྱུ་མ་སྤངས་ནས་ནི། །རྒྱལ་བའི་ཕོ་བྲང་བདེ་ཆེན་དུ། །
en: “Having left behind their magical illusion of a buddha, They remain in great bliss, which is the palace of the victorious ones;

source: རབ་ཞི་བདེ་བ་ཆེན་པོ་ལ། །ཀུན་དུ་དགའ་བའི་གཟུགས་ཀྱིས་བཞུགས།
en: Within the perfect peace of great bliss They abide in a form that is in all ways delightful.

source: བྱེད་པོ་རྟག་པ་གཅིག་པུས་བཞུགས། །ཡིན་སྙམ་དྲང་སྲོང་རྣམས་སེམས་ཏེ། །
en: “An agent, eternal and singular— Thus the sages regard the mind.

source: དེ་ལྟའི་ངོ་བོ་དེ་མིན་ཞེས། །དེ་ནི་སྐད་ཅིག་བསྡོམས་པར་འདོད། །
en: Yet it is taught that it is not of such an essence; Rather, it is held to be composed of moments.

source: བདག་ཏུ་འཛིན་པས་འཁྲུལ་པ་རྣམས། །རྟག་ཏུ་རྟག་པའི་དོན་འདོད་པ། །མི་རྟག་ཉིད་ལ་འཇུག་བྱའི་ཕྱིར། །རྒྱལ་བ་རྣམས་ཀྱི་སྐུ་གཏོང་མཛད། །
en: “The victorious ones will relinquish their bodies For those deluded because of holding on to a self, And for those who always want things to be permanent, So that they may be introduced to impermanence.

source: དངོས་པོ་ཀུན་གྱི་དངོས་བདག་ཉིད། །ཐུགས་ཀྱིས་ཐམས་ཅད་མཁྱེན་ཏེ་དག །
en: “Those who are of the nature of all things, And whose minds know everything,

source: འདི་དག་འདི་གནས་མ་ཡིན་ཞེས། །བྱས་པའི་ངེས་པ་ཡོད་མ་ཡིན། །
en: They cannot be definitively said To be absent anywhere.

source: ཀུན་རྫོབ་བདེན་པ་ལ་བརྟེན་ནས། །སྟོང་གསུམ་འདི་སོགས་གདུལ་བྱ་ལ། །
en: Based on the relative truth, And for those in this billion-fold universe and elsewhere who are in need of guidance,

source: སངས་རྒྱས་རྣམས་ཀྱིས་ཆོས་བསྟན་པ། །ནམ་མཁའ་མཉམ་པར་རབ་ཏུ་འཇུག །
en: The buddhas teach the Dharma Throughout the extent of space.

source: སངས་རྒྱས་འབྱུང་བ་དེ་ཉིད་མིན། །
en: “There is no real birth of a buddha,

source: སངས་རྒྱས་འགགས་པའང་དེ་བཞིན་ཏེ། །
en: Nor is there any real death of a buddha.

source: ཐམས་ཅད་རོ་གཅིག་གྱུར་པ་ཡི། །
en: Where everything is of the same taste,

source: འབྱུང་དང་འཇིག་པའི་རང་བཞིན་ནོ། །
en: This is the nature of arising and ceasing.

source: དེ་ནི་ཆོས་དབྱིངས་གཟུགས་གཅིག་སྟེ། །
en: “The buddhas are of the same body within the dharmadhātu,

source: སྒྲིབ་པ་ལྔ་པོ་སྤངས་པའོ། །
en: And they are free from the five obscurations.

source: ཟབ་ཅིང་རྒྱ་ནི་ཆེ་བའི་གཟུགས། །དེ་ཉིད་ངོ་བོར་དེ་ཉིད་བཞུགས། །
en: The body of the profound and the vast— It is as the essence of this reality that a buddha remains.

source: གཉིས་ཀ་ཡོད་པ་མ་ཡིན་ཕྱིར། །གདོད་ནས་ཡོད་པ་མ་ཡིན་ནོ། །
en: “Since neither is the case, They do, from the beginning, not exist.

source: དེ་ནི་གདོད་ནས་མ་སྐྱེས་པས། །སྐྱེ་བ་མ་ཡིན་འགག་མ་ཡིན།
en: Since from the beginning they have not arisen They do not arise and they do not cease.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The bodhisattvas asked,

source: ལག་ན་རྡོ་རྗེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཁམས་གསུམ་ལ་རྗེས་སུ་སྟོན་པ་མཛད་པ། སྐྱེ་བ་མེད་པ་འགག་པ་མེད་པ་ཅི་ལྟ་བུ་ཡིན།
en: “How is it, O Vajrapāṇi, that the buddhas, the blessed ones, the teachers of the three worlds, neither arise nor cease?”

source: ཀྱཻ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དེ་ཇི་སྙམ་དུ་སེམས། གང་སངས་རྒྱས་ཇི་སྙེད་པ་དེ་གང་ཞིག་ཡོད་པ་ཡིན་ནམ། འོན་ཏེ་མེད་པ་ཞིག་ཡིན།
en: Now, O bodhisattvas, what do you think? Does the one who is the Buddha exist, or not exist?

source: ལག་ན་རྡོ་རྗེ་སངས་རྒྱས་རྣམས་ནི་ཡོད་པ་ཡང་མ་ཡིན་མེད་པ་ཡང་མ་ཡིན་ནོ།
en: “O Vajrapāṇi, buddhas neither exist nor do they not exist,”

source: མ་སྐྱེས་པ་ནི་སྐྱེ་བ་ཡིན། །
en: “Indeed, it is the unborn that is born;

source: སྐྱེས་པ་ཕྱིར་ཡང་སྐྱེ་མི་འགྱུར། །
en: The born will never be born.

source: དོན་དམ་ཉིད་དུ་དཔྱད་ན་ནི། །དེ་ཕྱིར་གདོད་ནས་མ་སྐྱེས་པ། །
en: When investigated in terms of the ultimate They are unborn since the beginning.

source: དེ་བཞིན་འཆི་བ་འཆི་མི་འགྱུར། །འཆི་བ་མེད་པ་འཆི་བ་མིན།
en: “Likewise, the dead do not die, Nor does the one who is not dead.

source: མི་གནས་པ་ལ་གནས་པ་མེད། །
en: The non-abiding does not abide

source: གནས་པ་དེ་ལ་གནས་མི་དགོས། །
en: And the one who abides is not in need of abiding.

source: གལ་ཏེ་མ་སྐྱེས་ཉམས་འགྱུར་ཞིང་། །མ་སྐྱེས་པ་ཉིད་སྐྱེ་འགྱུར་ན། །
en: “If that which has not been born were subject to decay, Or if the unborn were subject to arising,

source: རི་བོང་གི་ནི་རྭ་ཉིད་ཀྱང་། །སྐྱེ་བ་དང་ནི་འགག་པར་འགྱུར། །
en: Then a rabbit’s horn would also Be subject to arising and cessation.

source: གང་ཚེ་ཡོད་པ་སྐྱེ་འགྱུར་ན། །སྐྱེས་པ་སླར་ཡང་སྐྱེ་བར་འགྱུར། །
en: “If that which exists were to arise, That which has arisen would arise once more.

source: གལ་ཏེ་མེད་པ་སྐྱེ་ན་ཡང་། །མོ་ཤམ་བུ་ཡང་སྐྱེ་བར་འགྱུར། །
en: Also, if that which does not exist were to arise, The barren woman’s son would arise too.

source: དེ་ཕྱིར་ཐམས་ཅད་མ་རིག་པ། །
en: “Therefore, everything is ignorance,

source: འདུ་བྱེད་གསུམ་གྱི་མཚན་ཉིད་ཡིན། །
en: Formations that possess the three characteristics.

source: ཕུང་པོ་ལྔ་ལྡན་འགྲོ་བ་རྣམས། །སྣང་བ་ཙམ་དུ་རྣམ་པར་ཤེས། །
en: The worlds that possess the five aggregates Are known as mere appearance.

source: རེ་ཞིག་རིགས་པ་འདིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མྱ་ངན་ལས་འདས་པ་ཤེས་པར་བྱའོ། །
en: “The bodhisattvas should understand the nirvāṇa that pertains to the buddhas, the blessed ones, through this reasoning.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སྨྲས་པ། །
en: The bodhisattvas asked:

source: ཐམས་ཅད་སྐྱེད་པ་མེད་པའི་ཕྱིར། །སྔགས་འདི་ཅི་ལྟར་རྒྱུད་ཅི་ལྟར།
en: “When nothing is produced, What are mantras, what are tantras,

source: དཀྱིལ་འཁོར་སྒོམ་པ་ཇི་ལྟ་བུ། །དངོས་གྲུབ་དེ་ནི་ཇི་ལྟར་འགྲུབ།
en: how does one visualize the maṇḍala? How, then, is accomplishment gained?”

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནི། །དངོས་པོ་རྣམས་ནི་འབྱུང་བ་ལྟར། །
en: “Originating in dependence— This is how things arise.

source: སྔགས་དང་ཕྱག་རྒྱ་སོགས་བརྟེན་ནས། །དངོས་གྲུབ་རྣམས་ནི་འབྱུང་བར་འགྱུར། །
en: Likewise, depending on mantras, mudrās, and so forth, The accomplishments are gained.

source: དངོས་གྲུབ་རྣམས་ནི་ཀུན་རྫོབ་པ། །སངས་རྒྱས་ཕ་རོལ་ཕྱིན་པ་ཡང་།
en: “The accomplishments are relative, And so are the transcendences of the Buddha.

source: སངས་རྒྱས་རྡོ་རྗེ་སེམས་དཔའ་ཉིད། །ཀུན་རྫོབ་ཉིད་དུ་རབ་སྒྲུབ་འགྱུར། །
en: Buddhahood, the state of Vajrasattva, Is perfectly accomplished in terms of the relative.”

source: རྟོག་པ་གཉིས་པའོ།། །
en: This was the second chapter.

source: སྔགས་བཟླས་པ་ཡི་ཆོ་གའི་རིམ། །དེ་ནས་ཡང་དག་བཤད་བྱ་བ།
en: The progression of the ritual for reciting the mantra Shall now be explained.

source: གང་ཞིག་ཤེས་པ་ཙམ་གྱིས་ནི། །སྒྲུབ་པོས་དངོས་གྲུབ་འགྱུར་བས་སོ། །
en: By merely understanding it, The practitioner will reach success.

source: བྱི་རུ་ཡིས་ནི་དབང་དུ་བྱེད། །
en: Coral is used for enthrallment,

source: པུས་ཀར་གོས་ནི་དུག་ཞི་བྱེད། །
en: Puṣkara removes poison,

source: ཤེལ་གྱིས་ཤེས་རབ་འཕེལ་བར་བྱེད། །
en: And with crystal insight will expand.

source: ལས་གསུམ་ལ་ནི་སྦྱར་བར་བྱ། །
en: These are to be used in three activities.

source: སྐྱེ་གནས་ཀྱི་རྣམ་པར་དག་པ་ཨ་ཤྭཏྠའི་འདབ་མའི་རྣམ་པ་ལྟ་བུའི་ཐབ་ཁུང་བྱས་ལ། མྱ་ངན་མེད་པའི་ཤིང་ལ་མེ་སྦར་ནས།
en: In a pit the shape of an aśvattha tree leaf, which is the pure nature of the place of birth, one should light a fire with wood from the aśoka tree.

source: ཆོ་ག་བཞིན་དུ་ཨུཏྤལ་དམར་པོ་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་བསྲེག་བྱས་ཏེ།
en: One must then, in the prescribed way, perform one hundred and eight offerings of red lotus flowers.

source: གར་མཁན་གྱི་ཁྱིམ་ནས་མེ་བླངས་ལ་མངར་གསུམ་གྱིས་བསྒོས་ནས། རྩ་བའི་སྔགས་དང་བྱ་བ་ཡིན་ནོ། །
en: The fire should be obtained from the home of an actor. The offerings are to be smeared with the three sweets and presented together with the root mantra.

source: ཕྱི་ནས་འཁྲུལ་འཁོར་བྱ་བ་ཡིན་ཏེ།
en: Next comes the diagram.

source: ཟླ་མཚན་གྱིས་གོས་པའི་རས་ལ་དཀྱིལ་འཁོར་གྲུ་གསུམ་བྲིས་ནས།
en: One should draw a triangular maṇḍala on cotton smeared with the mark of the moon.

source: དཀྱིལ་འཁོར་དུ་བསྒྲུབ་བྱ་དང་། སྒྲུབ་པ་པོའི་མིང་དང་བཅས་པའི་བསྐུལ་བའི་ཚིག་དང་བཅས་པར་བྲིས་ཏེ།
en: Within it, one writes entreating words that include the names of the practitioner and the one to be won:

source: ཆེ་གེ་མོ་བདག་གི་དབང་དུ་གྱུར་ཅིག་བྱས་ནས།
en: “Let me succeed in attracting such and such a person!”

source: དེ་ནས་རྩ་བའི་སྔགས་ཀྱིས་སྤེལ་ནས།
en: As one enriches this with the root mantra,

source: རྒྱ་སྐྱེགས་ཀྱི་ཁུ་བ་དང་། ལག་པ་གཡོན་པའི་སྲིན་ལག་གི་ཁྲག་དང་། ག་བུར་དང་། གུར་གུམ་དང་། གླ་རྩི་རྣམས་ཀྱི་ཚོན་རྩིས་བྲི་བར་བྱའོ།
en: one should write with a paint of liquid lac , blood from one’s left ring finger, camphor, kunkuma , and musk.

source: ཤེས་རབ་འཕེལ་བར་འདོད་ན་ཐབ་ཁུང་དེ་ཉིད་དུ་ཨ་རྒའམ། ཀ་ར་བཱི་རའི་ཤིང་ལ་བྲམ་ཟེའི་སྦྱིན་སྲེག་གི་མེ་བླངས་ལ་སྦར་ཏེ།
en: If one wishes to increase insight one should, in the same pit as before, burn arka and karavīra with the sacrificial fire used for brahmin oblations.

source: ཨ་ཀ་རུ་ཀའི་ཤའི་ཁྱིའི་མའམ། ཤུ་དག་གི་སྦྱིན་སྲེག་ཁྲི་བྱའོ། །
en: One should offer aṭarūṣaka leaves or sweet flag ten thousand times.

source: དུག་ཞི་བར་བྱེད་ན་ཐབ་ཁུང་དེ་ཉིད་དུ་ཙནྡན་གྱི་ཤིང་ལ་མེ་སྦར་ལ། པིང་ཏ་ཀ་རའི་མེ་ཏོག་གི་སྦྱིན་བསྲེག་བྱའོ། །
en: For removing poison, one should light a fire in the same basin with wood of the sandal tree, and in that offer the flowers of the piṇḍatagara

source: དེས་ནི་དུག་ཐམས་ཅད་ཞི་བར་འགུགས་པར་འགྱུར་རོ། །
en: Thus one will become a curer of all poison.

source: སྣ་ཚོགས་ཀྱི་ཟུག་གཟེར་རྣམས་མེད་པར་བྱེད་ཅིང་ཞི་བར་བྱེད་དོ། །
en: One will heal the different pains and bring peace.

source: མཁའ་ལྡིང་གི་རིག་པའི་རྒྱུད་ཀྱི་ཆོ་གའོ། །
en: This is the rite of the gāruḍa knowledge tantra.

source: ཁམས་གསུམ་པ་ཡི་ལམ་གནས་པའི། །བཙུན་མོར་གྲགས་པ་ཇི་སྙེད་པ། །སྦྱིན་སྲེག་འཁྲུལ་འཁོར་སྦྱོར་བ་ཡིས། །
en: On the paths of the triple universe One will attract and engage with All those who are known as noblewomen By means of oblation and the diagram.

source: དེ་ཀུན་བཀུག་ནས་སྤྱོད་པར་བྱེད། །བྱམས་པ་ཆགས་པའི་ལྟ་བ་ཡིས།
en: Loving-kindness through looking with impassioned love—

source: སེམས་དེ་ཡིས་ནི་དབང་དུ་བྱེད། །
en: It is through such a mind that one performs enthrallment.

source: འགྲོ་བ་ཐམས་ཅད་དབང་བྱས་ནས། །སངས་རྒྱས་བྱང་ཆུབ་ངེས་པར་སྤྱོད། །
en: Having enthralled all beings, One establishes them in the enlightenment of the Buddha.

source: འདི་ནི་དབང་དུ་བྱ་བའི་ཆོ་གའོ། །
en: This is the rite of enthrallment.

source: རྣམ་པ་ཀུན་མཁྱེན་ཞེས་བྱ་བ། །ཤེས་རབ་མེད་པར་ཐོབ་མི་འགྱུར། །
en: The so-called “knower of everything” Cannot be attained without insight.

source: དེ་ཕྱིར་དེ་ཐོབ་འདོད་པ་གང་། །ཤེས་རབ་རྣོན་པོ་བསྒྲུབ་པར་བྱ། །
en: The one who wishes to attain it Should therefore develop incisive insight.

source: བཟླས་དང་སྦྱིན་སྲེག་སྦྱོར་བ་ཡིས། །ཆོས་རྣམས་ཀུན་ལ་སྤྱོད་པའོ། །
en: Through the practice of recitation and oblations One will encounter all phenomena.

source: བློ་ནི་དག་གསལ་དྲི་མ་མེད། །དེ་ཉིད་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །
en: The mind that is pure, bright, and stainless— That indeed is the transcendent insight.

source: རྣལ་འབྱོར་པ་ནི་གྲོལ་བར་འགྱུར། །
en: The yogin will be liberated.

source: གྲི་ཧ་པི་དའི་ལོ་མ་དང་། །ཤ་ཏི་དང་ནི་ཤིང་མངར་དང་། །བྲམ་ཟེ་མོ་དང་མ་ག་ཏ། །སྦྲང་དང་བཅས་པས་བཟའ་བར་བྱ། །
en: The leaves of gṛhābhidhāna, Ṣaṭhī, liquorice Brahmāṇī, māgadhī, and honey— These are to be eaten.

source: ཤེས་རབ་འཕེལ་བར་བྱ་བའི་ཆོ་གའོ། །
en: This is the ritual for increasing insight.

source: དུག་རྗེས་སྦྲང་རྩི་མར་དང་བཅས། །འཁོར་ལོ་བཟང་རྩ་དེ་བཞིན་ཏེ། །
en: Next there is honey with ghee, Cakrāṅkita , and the good root—
